#+TITLE: Exercise 6: Arrays and 2D Arrays
#+AUTHOR: PRAVEEN KUMAR R

#+LaTeX_HEADER: \usepackage{palatino}
#+LaTeX_HEADER: \usepackage[top=1in, bottom=1.25in, left=1.25in, right=1.25in]{geometry}
#+LaTeX_HEADER: \usepackage{setspace}
#+OPTIONS: toc:nil

#+BEGIN_EXPORT latex
\linespread{1.2}
#+END_EXPORT
#+PROPERTY: header-args :exports both
| Assignment | 6 |
| Reg No     | 312217104114 |
| Name       |PRAVEEN KUMAR R |
| Grade      |   |
| Date       | 17-03-2018 | 
  #+LATEX: \linespread{1}
** program
#+BEGIN_SRC C :cmdline <ex06_4.in
#include<stdio.h>
float cal_avg(int a[],int n)
{
 float sum=0;
 for(int i=0;i<n;i++)
    sum+=a[i];
 return sum/n;
}
int main()
{
 int a[100],n;
 scanf("%d",&n);
 for(int i=0;i<n;i++)
  scanf("%d",&a[i]);
for(int i=0;i<n;i++)
  printf("%d%c",a[i],i<n-1?',':'\n');
 float avg= cal_avg(a,n);
 int count=0;
 for(int i=0;i<n;i++)
   if(avg<a[i])
      count++;
 printf("\n%d",count);
return 0;
}

#+END_SRC

#+RESULTS:
| 23,43,56,43,31,24,33,22 |
|                         |
|                       3 |

5. Populate a two dimensional array =a[N][N]= with heights
   and weights of persons and compute the Body Mass Index
   (BMI) of the individuals. =a[i][0]= and =a[i][1]= are the
   height and weight of =i= th person.  BMI is defined as
   #
   \[
   \text{BMI} = \cfrac{\text{weight}}{\text{height}^2}
   \]
   where weight is in kg and height is in m.
   #+BEGIN_SRC C :cmdline <ex06_5.in
     #include<stdio.h>
     void calc_bmi(float a[100][2],int n,float bmi[100])
     {
       for(int i=0;i<n;i++)
         {
           bmi[i]=a[i][1]/(a[i][0]*a[i][0]);
         }
     }
     int main()
     {
       float a[100][2],bmi[100];
       int n;
       scanf("%d",&n);
       for(int i=0;i<n;i++)
         scanf("%f%f",&a[i][1],&a[i][0]);
       calc_bmi(a,n,bmi);
       printf("weight\theight\tBMI\n");
       for(int i=0;i<n;i++)
         {
           printf("%f \t %f \t %f \n",a[i][1],a[i][0],bmi[i]);
         } 
     }

      
   #+END_SRC
